/**
 * 提示信息
 */
export const message = {
  // 系统错误
  '1001': '系统错误,请联系管理员',

  // 登录错误
  '2001': '用户名或密码错误',
  '2002': '数据更新成功!',
  '2003': '数据更新失败!',
  '2004': '此操作将永久删除该数据, 是否继续?',
  '2005': '删除成功!',
  '2006': '已取消删除',
  '2007': '数据新增成功!',
  '2008': '数据新增失败!',
  '2009': '数据查询失败!',
  '2010': '请选择一条数据',
  '2011': '密码修改成功',
  '2012': '旧密码不正确',
  '2013': '密码修改失败',
  '2014': '两次密码输入不一致',

  '2019': '角色配置成功',
  '2020': '角色配置失败',

  '2021': '账号已存在',
  '2022': '是否通过审核',

  '2023': '配置失败',
  '2024': '配置成功'
};
